wub163/XW_0011_F_0162_V1.0.0/MM32F0160_Device/MM32F0160/Include/reg_exti.h
/*
 *******************************************************************************
    @file     reg_exti.h
    @author   AE TEAM
    @brief    THIS FILE CONTAINS ALL THE FUNCTIONS PROTOTYPES FOR THE ADC
              FIRMWARE LIBRARY.
 *******************************************************************************
    @attention

    <h2><center>&copy; Copyright(c) <2023> <MindMotion></center></h2>

    Redistribution and use in source and binary forms, with or without
    modification, are permitted provided that the
    following conditions are met:
    1. Redistributions of source code must retain the above copyright notice,
       this list of conditions and the following disclaimer.
    2. Redistributions in binary form must reproduce the above copyright notice,
       this list of conditions and the following disclaimer in the documentation
       and/or other materials provided with the distribution.
    3. Neither the name of the copyright holder nor the names of its
       contributors may be used to endorse or promote products derived from this
       software without specific prior written permission.

    THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
    AND ANY EXPRESS OR IMPLIED WARRANTIES,INCLUDING, BUT NOT LIMITED TO,
    THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
    PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR
    CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL,
    EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO,
    PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS;
    OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY,
    WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR
    OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF
    ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 *******************************************************************************
 */

/* Define to prevent recursive inclusion -------------------------------------*/

#ifndef __REG_EXTI_H
#define __REG_EXTI_H

/* Files includes ------------------------------------------------------------*/
#include <core_cm0.h>

#ifdef __cplusplus
extern "C" {
#endif

#if defined(__CC_ARM)
#pragma anon_unions
#elif defined(__ICCARM__)
#pragma language=extended
#elif defined(__ARMCC_VERSION) && (__ARMCC_VERSION >= 6010050)
#pragma clang diagnostic ignored "-Wc11-extensions"
#pragma clang diagnostic ignored "-Wreserved-id-macro"
#elif defined(__GNUC__)
/* anonymous unions are enabled by default */
#else
#warning Not supported compiler type
#endif

/**
  * @brief EXTI Base Address Definition
  */
#define EXTI_BASE                       (APB2PERIPH_BASE + 0x0400)              /*!< Base Address: 0x40010400 */

/**
  * @brief EXTI Registers Structure Definition
  */
typedef struct {
    __IO uint32_t IMR;                                                          /*!< Interrupt Mask Register                        offset: 0x00 */
    __IO uint32_t EMR;                                                          /*!< Event Mask Register                            offset: 0x04 */
    __IO uint32_t RTSR;                                                         /*!< Rising Trigger Status Register                 offset: 0x08 */
    __IO uint32_t FTSR;                                                         /*!< Falling Trigger Status Register                offset: 0x0C */
    __IO uint32_t SWIER;                                                        /*!< Software Interrupt Enable Register             offset: 0x10 */
    __IO uint32_t PR;                                                           /*!< Pending Register                               offset: 0x14 */
} EXTI_TypeDef;

/**
  * @brief EXTI type pointer Definition
  */
#define EXTI                            ((EXTI_TypeDef*) EXTI_BASE)

/**
  * @brief EXTI_IMR Register Bit Definition
  */
#define EXTI_IMR_Pos                    (0)
#define EXTI_IMR                        (0xFFFFFFFFU << EXTI_IMR_Pos)           /*!< Interrupt Mask */

#define EXTI_IMR_0_Pos                  (0)
#define EXTI_IMR_0                      (0x01U << EXTI_IMR_0_Pos)               /*!< Interrupt Mask on line 0 */
#define EXTI_IMR_1_Pos                  (1)
#define EXTI_IMR_1                      (0x01U << EXTI_IMR_1_Pos)               /*!< Interrupt Mask on line 1 */
#define EXTI_IMR_2_Pos                  (2)
#define EXTI_IMR_2                      (0x01U << EXTI_IMR_2_Pos)               /*!< Interrupt Mask on line 2 */
#define EXTI_IMR_3_Pos                  (3)
#define EXTI_IMR_3                      (0x01U << EXTI_IMR_3_Pos)               /*!< Interrupt Mask on line 3 */
#define EXTI_IMR_4_Pos                  (4)
#define EXTI_IMR_4                      (0x01U << EXTI_IMR_4_Pos)               /*!< Interrupt Mask on line 4 */
#define EXTI_IMR_5_Pos                  (5)
#define EXTI_IMR_5                      (0x01U << EXTI_IMR_5_Pos)               /*!< Interrupt Mask on line 5 */
#define EXTI_IMR_6_Pos                  (6)
#define EXTI_IMR_6                      (0x01U << EXTI_IMR_6_Pos)               /*!< Interrupt Mask on line 6 */
#define EXTI_IMR_7_Pos                  (7)
#define EXTI_IMR_7                      (0x01U << EXTI_IMR_7_Pos)               /*!< Interrupt Mask on line 7 */
#define EXTI_IMR_8_Pos                  (8)
#define EXTI_IMR_8                      (0x01U << EXTI_IMR_8_Pos)               /*!< Interrupt Mask on line 8 */
#define EXTI_IMR_9_Pos                  (9)
#define EXTI_IMR_9                      (0x01U << EXTI_IMR_9_Pos)               /*!< Interrupt Mask on line 9 */
#define EXTI_IMR_10_Pos                 (10)
#define EXTI_IMR_10                     (0x01U << EXTI_IMR_10_Pos)              /*!< Interrupt Mask on line 10 */
#define EXTI_IMR_11_Pos                 (11)
#define EXTI_IMR_11                     (0x01U << EXTI_IMR_11_Pos)              /*!< Interrupt Mask on line 11 */
#define EXTI_IMR_12_Pos                 (12)
#define EXTI_IMR_12                     (0x01U << EXTI_IMR_12_Pos)              /*!< Interrupt Mask on line 12 */
#define EXTI_IMR_13_Pos                 (13)
#define EXTI_IMR_13                     (0x01U << EXTI_IMR_13_Pos)              /*!< Interrupt Mask on line 13 */
#define EXTI_IMR_14_Pos                 (14)
#define EXTI_IMR_14                     (0x01U << EXTI_IMR_14_Pos)              /*!< Interrupt Mask on line 14 */
#define EXTI_IMR_15_Pos                 (15)
#define EXTI_IMR_15                     (0x01U << EXTI_IMR_15_Pos)              /*!< Interrupt Mask on line 15 */
#define EXTI_IMR_16_Pos                 (16)
#define EXTI_IMR_16                     (0x01U << EXTI_IMR_16_Pos)              /*!< Interrupt Mask on line 16 */
#define EXTI_IMR_17_Pos                 (17)
#define EXTI_IMR_17                     (0x01U << EXTI_IMR_17_Pos)              /*!< Interrupt Mask on line 17 */
#define EXTI_IMR_18_Pos                 (18)
#define EXTI_IMR_18                     (0x01U << EXTI_IMR_18_Pos)              /*!< Interrupt Mask on line 18 */
#define EXTI_IMR_19_Pos                 (19)
#define EXTI_IMR_19                     (0x01U << EXTI_IMR_19_Pos)              /*!< Interrupt Mask on line 19 */
#define EXTI_IMR_20_Pos                 (20)
#define EXTI_IMR_20                     (0x01U << EXTI_IMR_20_Pos)              /*!< Interrupt Mask on line 20 */
#define EXTI_IMR_21_Pos                 (21)
#define EXTI_IMR_21                     (0x01U << EXTI_IMR_21_Pos)              /*!< Interrupt Mask on line 21 */
#define EXTI_IMR_22_Pos                 (22)
#define EXTI_IMR_22                     (0x01U << EXTI_IMR_22_Pos)              /*!< Interrupt Mask on line 22 */
#define EXTI_IMR_23_Pos                 (23)
#define EXTI_IMR_23                     (0x01U << EXTI_IMR_23_Pos)              /*!< Interrupt Mask on line 23 */
#define EXTI_IMR_24_Pos                 (24)
#define EXTI_IMR_24                     (0x01U << EXTI_IMR_24_Pos)              /*!< Interrupt Mask on line 24 */
#define EXTI_IMR_25_Pos                 (25)
#define EXTI_IMR_25                     (0x01U << EXTI_IMR_25_Pos)              /*!< Interrupt Mask on line 25 */
#define EXTI_IMR_26_Pos                 (26)
#define EXTI_IMR_26                     (0x01U << EXTI_IMR_26_Pos)              /*!< Interrupt Mask on line 26 */
#define EXTI_IMR_27_Pos                 (27)
#define EXTI_IMR_27                     (0x01U << EXTI_IMR_27_Pos)              /*!< Interrupt Mask on line 27 */
#define EXTI_IMR_28_Pos                 (28)
#define EXTI_IMR_28                     (0x01U << EXTI_IMR_28_Pos)              /*!< Interrupt Mask on line 28 */
#define EXTI_IMR_29_Pos                 (29)
#define EXTI_IMR_29                     (0x01U << EXTI_IMR_29_Pos)              /*!< Interrupt Mask on line 29 */
#define EXTI_IMR_30_Pos                 (30)
#define EXTI_IMR_30                     (0x01U << EXTI_IMR_30_Pos)              /*!< Interrupt Mask on line 30 */
#define EXTI_IMR_31_Pos                 (31)
#define EXTI_IMR_31                     (0x01U << EXTI_IMR_31_Pos)              /*!< Interrupt Mask on line 31 */

/**
  * @brief EXTI_EMR Register Bit Definition
  */
#define EXTI_EMR_Pos                    (0)
#define EXTI_EMR                        (0xFFFFFFFFU << EXTI_EMR_Pos)           /*!< Event Mask */

