wub163/XW_0011_F_0162_V1.0.0/MM32F0160_Device/MM32F0160/Include/reg_exti.h
#define EXTI_EMR_0_Pos                  (0)
#define EXTI_EMR_0                      (0x01U << EXTI_EMR_0_Pos)               /*!< Event Mask on line 0 */
#define EXTI_EMR_1_Pos                  (1)
#define EXTI_EMR_1                      (0x01U << EXTI_EMR_1_Pos)               /*!< Event Mask on line 1 */
#define EXTI_EMR_2_Pos                  (2)
#define EXTI_EMR_2                      (0x01U << EXTI_EMR_2_Pos)               /*!< Event Mask on line 2 */
#define EXTI_EMR_3_Pos                  (3)
#define EXTI_EMR_3                      (0x01U << EXTI_EMR_3_Pos)               /*!< Event Mask on line 3 */
#define EXTI_EMR_4_Pos                  (4)
#define EXTI_EMR_4                      (0x01U << EXTI_EMR_4_Pos)               /*!< Event Mask on line 4 */
#define EXTI_EMR_5_Pos                  (5)
#define EXTI_EMR_5                      (0x01U << EXTI_EMR_5_Pos)               /*!< Event Mask on line 5 */
#define EXTI_EMR_6_Pos                  (6)
#define EXTI_EMR_6                      (0x01U << EXTI_EMR_6_Pos)               /*!< Event Mask on line 6 */
#define EXTI_EMR_7_Pos                  (7)
#define EXTI_EMR_7                      (0x01U << EXTI_EMR_7_Pos)               /*!< Event Mask on line 7 */
#define EXTI_EMR_8_Pos                  (8)
#define EXTI_EMR_8                      (0x01U << EXTI_EMR_8_Pos)               /*!< Event Mask on line 8 */
#define EXTI_EMR_9_Pos                  (9)
#define EXTI_EMR_9                      (0x01U << EXTI_EMR_9_Pos)               /*!< Event Mask on line 9 */
#define EXTI_EMR_10_Pos                 (10)
#define EXTI_EMR_10                     (0x01U << EXTI_EMR_10_Pos)              /*!< Event Mask on line 10 */
#define EXTI_EMR_11_Pos                 (11)
#define EXTI_EMR_11                     (0x01U << EXTI_EMR_11_Pos)              /*!< Event Mask on line 11 */
#define EXTI_EMR_12_Pos                 (12)
#define EXTI_EMR_12                     (0x01U << EXTI_EMR_12_Pos)              /*!< Event Mask on line 12 */
#define EXTI_EMR_13_Pos                 (13)
#define EXTI_EMR_13                     (0x01U << EXTI_EMR_13_Pos)              /*!< Event Mask on line 13 */
#define EXTI_EMR_14_Pos                 (14)
#define EXTI_EMR_14                     (0x01U << EXTI_EMR_14_Pos)              /*!< Event Mask on line 14 */
#define EXTI_EMR_15_Pos                 (15)
#define EXTI_EMR_15                     (0x01U << EXTI_EMR_15_Pos)              /*!< Event Mask on line 15 */
#define EXTI_EMR_16_Pos                 (16)
#define EXTI_EMR_16                     (0x01U << EXTI_EMR_16_Pos)              /*!< Event Mask on line 16 */
#define EXTI_EMR_17_Pos                 (17)
#define EXTI_EMR_17                     (0x01U << EXTI_EMR_17_Pos)              /*!< Event Mask on line 17 */
#define EXTI_EMR_18_Pos                 (18)
#define EXTI_EMR_18                     (0x01U << EXTI_EMR_18_Pos)              /*!< Event Mask on line 18 */
#define EXTI_EMR_19_Pos                 (19)
#define EXTI_EMR_19                     (0x01U << EXTI_EMR_19_Pos)              /*!< Event Mask on line 19 */
#define EXTI_EMR_20_Pos                 (20)
#define EXTI_EMR_20                     (0x01U << EXTI_EMR_20_Pos)              /*!< Event Mask on line 20 */
#define EXTI_EMR_21_Pos                 (21)
#define EXTI_EMR_21                     (0x01U << EXTI_EMR_21_Pos)              /*!< Event Mask on line 21 */
#define EXTI_EMR_22_Pos                 (22)
#define EXTI_EMR_22                     (0x01U << EXTI_EMR_22_Pos)              /*!< Event Mask on line 22 */
#define EXTI_EMR_23_Pos                 (23)
#define EXTI_EMR_23                     (0x01U << EXTI_EMR_23_Pos)              /*!< Event Mask on line 23 */
#define EXTI_EMR_24_Pos                 (24)
#define EXTI_EMR_24                     (0x01U << EXTI_EMR_24_Pos)              /*!< Event Mask on line 24 */
#define EXTI_EMR_25_Pos                 (25)
#define EXTI_EMR_25                     (0x01U << EXTI_EMR_25_Pos)              /*!< Event Mask on line 25 */
#define EXTI_EMR_26_Pos                 (26)
#define EXTI_EMR_26                     (0x01U << EXTI_EMR_26_Pos)              /*!< Event Mask on line 26 */
#define EXTI_EMR_27_Pos                 (27)
#define EXTI_EMR_27                     (0x01U << EXTI_EMR_27_Pos)              /*!< Event Mask on line 27 */
#define EXTI_EMR_28_Pos                 (28)
#define EXTI_EMR_28                     (0x01U << EXTI_EMR_28_Pos)              /*!< Event Mask on line 28 */
#define EXTI_EMR_29_Pos                 (29)
#define EXTI_EMR_29                     (0x01U << EXTI_EMR_29_Pos)              /*!< Event Mask on line 29 */
#define EXTI_EMR_30_Pos                 (30)
#define EXTI_EMR_30                     (0x01U << EXTI_EMR_30_Pos)              /*!< Event Mask on line 30 */
#define EXTI_EMR_31_Pos                 (31)
#define EXTI_EMR_31                     (0x01U << EXTI_EMR_31_Pos)              /*!< Event Mask on line 31 */

/**
  * @brief EXTI_RTSR Register Bit Definition
  */
#define EXTI_RTSR_TR_Pos                (0)
#define EXTI_RTSR_TR                    (0xFFFFFFFFU << EXTI_RTSR_TR_Pos)       /*!< Rising trigger event configuration bit */

#define EXTI_RTSR_TR_0_Pos              (0)
#define EXTI_RTSR_TR_0                  (0x01U << EXTI_RTSR_TR_0_Pos)           /*!< Rising trigger event configuration bit of line 0 */
#define EXTI_RTSR_TR_1_Pos              (1)
#define EXTI_RTSR_TR_1                  (0x01U << EXTI_RTSR_TR_1_Pos)           /*!< Rising trigger event configuration bit of line 1 */
#define EXTI_RTSR_TR_2_Pos              (2)
#define EXTI_RTSR_TR_2                  (0x01U << EXTI_RTSR_TR_2_Pos)           /*!< Rising trigger event configuration bit of line 2 */
#define EXTI_RTSR_TR_3_Pos              (3)
#define EXTI_RTSR_TR_3                  (0x01U << EXTI_RTSR_TR_3_Pos)           /*!< Rising trigger event configuration bit of line 3 */
#define EXTI_RTSR_TR_4_Pos              (4)
#define EXTI_RTSR_TR_4                  (0x01U << EXTI_RTSR_TR_4_Pos)           /*!< Rising trigger event configuration bit of line 4 */
#define EXTI_RTSR_TR_5_Pos              (5)
#define EXTI_RTSR_TR_5                  (0x01U << EXTI_RTSR_TR_5_Pos)           /*!< Rising trigger event configuration bit of line 5 */
#define EXTI_RTSR_TR_6_Pos              (6)
#define EXTI_RTSR_TR_6                  (0x01U << EXTI_RTSR_TR_6_Pos)           /*!< Rising trigger event configuration bit of line 6 */
#define EXTI_RTSR_TR_7_Pos              (7)
#define EXTI_RTSR_TR_7                  (0x01U << EXTI_RTSR_TR_7_Pos)           /*!< Rising trigger event configuration bit of line 7 */
#define EXTI_RTSR_TR_8_Pos              (8)
#define EXTI_RTSR_TR_8                  (0x01U << EXTI_RTSR_TR_8_Pos)           /*!< Rising trigger event configuration bit of line 8 */
#define EXTI_RTSR_TR_9_Pos              (9)
#define EXTI_RTSR_TR_9                  (0x01U << EXTI_RTSR_TR_9_Pos)           /*!< Rising trigger event configuration bit of line 9 */
#define EXTI_RTSR_TR_10_Pos             (10)
#define EXTI_RTSR_TR_10                 (0x01U << EXTI_RTSR_TR_10_Pos)          /*!< Rising trigger event configuration bit of line 10 */
#define EXTI_RTSR_TR_11_Pos             (11)
#define EXTI_RTSR_TR_11                 (0x01U << EXTI_RTSR_TR_11_Pos)          /*!< Rising trigger event configuration bit of line 11 */
#define EXTI_RTSR_TR_12_Pos             (12)
#define EXTI_RTSR_TR_12                 (0x01U << EXTI_RTSR_TR_12_Pos)          /*!< Rising trigger event configuration bit of line 12 */
#define EXTI_RTSR_TR_13_Pos             (13)
#define EXTI_RTSR_TR_13                 (0x01U << EXTI_RTSR_TR_13_Pos)          /*!< Rising trigger event configuration bit of line 13 */
#define EXTI_RTSR_TR_14_Pos             (14)
#define EXTI_RTSR_TR_14                 (0x01U << EXTI_RTSR_TR_14_Pos)          /*!< Rising trigger event configuration bit of line 14 */
#define EXTI_RTSR_TR_15_Pos             (15)
#define EXTI_RTSR_TR_15                 (0x01U << EXTI_RTSR_TR_15_Pos)          /*!< Rising trigger event configuration bit of line 15 */
#define EXTI_RTSR_TR_16_Pos             (16)
#define EXTI_RTSR_TR_16                 (0x01U << EXTI_RTSR_TR_16_Pos)          /*!< Rising trigger event configuration bit of line 16 */
#define EXTI_RTSR_TR_17_Pos             (17)
#define EXTI_RTSR_TR_17                 (0x01U << EXTI_RTSR_TR_17_Pos)          /*!< Rising trigger event configuration bit of line 17 */
#define EXTI_RTSR_TR_18_Pos             (18)
#define EXTI_RTSR_TR_18                 (0x01U << EXTI_RTSR_TR_18_Pos)          /*!< Rising trigger event configuration bit of line 18 */
#define EXTI_RTSR_TR_19_Pos             (19)
#define EXTI_RTSR_TR_19                 (0x01U << EXTI_RTSR_TR_19_Pos)          /*!< Rising trigger event configuration bit of line 19 */
#define EXTI_RTSR_TR_20_Pos             (20)
#define EXTI_RTSR_TR_20                 (0x01U << EXTI_RTSR_TR_20_Pos)          /*!< Rising trigger event configuration bit of line 20 */
#define EXTI_RTSR_TR_21_Pos             (21)
#define EXTI_RTSR_TR_21                 (0x01U << EXTI_RTSR_TR_21_Pos)          /*!< Rising trigger event configuration bit of line 21 */
#define EXTI_RTSR_TR_22_Pos             (22)
#define EXTI_RTSR_TR_22                 (0x01U << EXTI_RTSR_TR_22_Pos)          /*!< Rising trigger event configuration bit of line 22 */
#define EXTI_RTSR_TR_23_Pos             (23)
#define EXTI_RTSR_TR_23                 (0x01U << EXTI_RTSR_TR_23_Pos)          /*!< Rising trigger event configuration bit of line 23 */
#define EXTI_RTSR_TR_24_Pos             (24)
#define EXTI_RTSR_TR_24                 (0x01U << EXTI_RTSR_TR_24_Pos)          /*!< Rising trigger event configuration bit of line 24 */
#define EXTI_RTSR_TR_25_Pos             (25)
#define EXTI_RTSR_TR_25                 (0x01U << EXTI_RTSR_TR_25_Pos)          /*!< Rising trigger event configuration bit of line 25 */
#define EXTI_RTSR_TR_26_Pos             (26)
#define EXTI_RTSR_TR_26                 (0x01U << EXTI_RTSR_TR_26_Pos)          /*!< Rising trigger event configuration bit of line 26 */
#define EXTI_RTSR_TR_27_Pos             (27)
#define EXTI_RTSR_TR_27                 (0x01U << EXTI_RTSR_TR_27_Pos)          /*!< Rising trigger event configuration bit of line 27 */
#define EXTI_RTSR_TR_28_Pos             (28)
#define EXTI_RTSR_TR_28                 (0x01U << EXTI_RTSR_TR_28_Pos)          /*!< Rising trigger event configuration bit of line 28 */
#define EXTI_RTSR_TR_29_Pos             (29)
#define EXTI_RTSR_TR_29                 (0x01U << EXTI_RTSR_TR_29_Pos)          /*!< Rising trigger event configuration bit of line 29 */
#define EXTI_RTSR_TR_30_Pos             (30)
#define EXTI_RTSR_TR_30                 (0x01U << EXTI_RTSR_TR_30_Pos)          /*!< Rising trigger event configuration bit of line 30 */
#define EXTI_RTSR_TR_31_Pos             (31)
#define EXTI_RTSR_TR_31                 (0x01U << EXTI_RTSR_TR_31_Pos)          /*!< Rising trigger event configuration bit of line 31 */

/**
  * @brief EXTI_FTSR Register Bit Definition
  */
#define EXTI_FTSR_TR_Pos                (0)
#define EXTI_FTSR_TR                    (0xFFFFFFFFU << EXTI_FTSR_TR_Pos)       /*!< Falling trigger event configuration bit */

#define EXTI_FTSR_TR_0_Pos              (0)
#define EXTI_FTSR_TR_0                  (0x01U << EXTI_FTSR_TR_0_Pos)           /*!< Falling trigger event configuration bit of line 0 */
#define EXTI_FTSR_TR_1_Pos              (1)
#define EXTI_FTSR_TR_1                  (0x01U << EXTI_FTSR_TR_1_Pos)           /*!< Falling trigger event configuration bit of line 1 */
#define EXTI_FTSR_TR_2_Pos              (2)
#define EXTI_FTSR_TR_2                  (0x01U << EXTI_FTSR_TR_2_Pos)           /*!< Falling trigger event configuration bit of line 2 */
#define EXTI_FTSR_TR_3_Pos              (3)
#define EXTI_FTSR_TR_3                  (0x01U << EXTI_FTSR_TR_3_Pos)           /*!< Falling trigger event configuration bit of line 3 */
#define EXTI_FTSR_TR_4_Pos              (4)
#define EXTI_FTSR_TR_4                  (0x01U << EXTI_FTSR_TR_4_Pos)           /*!< Falling trigger event configuration bit of line 4 */
#define EXTI_FTSR_TR_5_Pos              (5)
#define EXTI_FTSR_TR_5                  (0x01U << EXTI_FTSR_TR_5_Pos)           /*!< Falling trigger event configuration bit of line 5 */
#define EXTI_FTSR_TR_6_Pos              (6)
#define EXTI_FTSR_TR_6                  (0x01U << EXTI_FTSR_TR_6_Pos)           /*!< Falling trigger event configuration bit of line 6 */
#define EXTI_FTSR_TR_7_Pos              (7)
#define EXTI_FTSR_TR_7                  (0x01U << EXTI_FTSR_TR_7_Pos)           /*!< Falling trigger event configuration bit of line 7 */
#define EXTI_FTSR_TR_8_Pos              (8)
#define EXTI_FTSR_TR_8                  (0x01U << EXTI_FTSR_TR_8_Pos)           /*!< Falling trigger event configuration bit of line 8 */
#define EXTI_FTSR_TR_9_Pos              (9)
#define EXTI_FTSR_TR_9                  (0x01U << EXTI_FTSR_TR_9_Pos)           /*!< Falling trigger event configuration bit of line 9 */
#define EXTI_FTSR_TR_10_Pos             (10)
#define EXTI_FTSR_TR_10                 (0x01U << EXTI_FTSR_TR_10_Pos)          /*!< Falling trigger event configuration bit of line 10 */
#define EXTI_FTSR_TR_11_Pos             (11)
#define EXTI_FTSR_TR_11                 (0x01U << EXTI_FTSR_TR_11_Pos)          /*!< Falling trigger event configuration bit of line 11 */
#define EXTI_FTSR_TR_12_Pos             (12)
#define EXTI_FTSR_TR_12                 (0x01U << EXTI_FTSR_TR_12_Pos)          /*!< Falling trigger event configuration bit of line 12 */
#define EXTI_FTSR_TR_13_Pos             (13)
#define EXTI_FTSR_TR_13                 (0x01U << EXTI_FTSR_TR_13_Pos)          /*!< Falling trigger event configuration bit of line 13 */
#define EXTI_FTSR_TR_14_Pos             (14)
#define EXTI_FTSR_TR_14                 (0x01U << EXTI_FTSR_TR_14_Pos)          /*!< Falling trigger event configuration bit of line 14 */
#define EXTI_FTSR_TR_15_Pos             (15)
#define EXTI_FTSR_TR_15                 (0x01U << EXTI_FTSR_TR_15_Pos)          /*!< Falling trigger event configuration bit of line 15 */
#define EXTI_FTSR_TR_16_Pos             (16)
#define EXTI_FTSR_TR_16                 (0x01U << EXTI_FTSR_TR_16_Pos)          /*!< Falling trigger event configuration bit of line 16 */
#define EXTI_FTSR_TR_17_Pos             (17)
#define EXTI_FTSR_TR_17                 (0x01U << EXTI_FTSR_TR_17_Pos)          /*!< Falling trigger event configuration bit of line 17 */
#define EXTI_FTSR_TR_18_Pos             (18)
#define EXTI_FTSR_TR_18                 (0x01U << EXTI_FTSR_TR_18_Pos)          /*!< Falling trigger event configuration bit of line 18 */
#define EXTI_FTSR_TR_19_Pos             (19)
#define EXTI_FTSR_TR_19                 (0x01U << EXTI_FTSR_TR_19_Pos)          /*!< Falling trigger event configuration bit of line 19 */
#define EXTI_FTSR_TR_20_Pos             (20)
#define EXTI_FTSR_TR_20                 (0x01U << EXTI_FTSR_TR_20_Pos)          /*!< Falling trigger event configuration bit of line 20 */
#define EXTI_FTSR_TR_21_Pos             (21)
#define EXTI_FTSR_TR_21                 (0x01U << EXTI_FTSR_TR_21_Pos)          /*!< Falling trigger event configuration bit of line 21 */
#define EXTI_FTSR_TR_22_Pos             (22)
#define EXTI_FTSR_TR_22                 (0x01U << EXTI_FTSR_TR_22_Pos)          /*!< Falling trigger event configuration bit of line 22 */
#define EXTI_FTSR_TR_23_Pos             (23)
#define EXTI_FTSR_TR_23                 (0x01U << EXTI_FTSR_TR_23_Pos)          /*!< Falling trigger event configuration bit of line 23 */
#define EXTI_FTSR_TR_24_Pos             (24)
#define EXTI_FTSR_TR_24                 (0x01U << EXTI_FTSR_TR_24_Pos)          /*!< Falling trigger event configuration bit of line 24 */
#define EXTI_FTSR_TR_25_Pos             (25)
#define EXTI_FTSR_TR_25                 (0x01U << EXTI_FTSR_TR_25_Pos)          /*!< Falling trigger event configuration bit of line 25 */
#define EXTI_FTSR_TR_26_Pos             (26)
#define EXTI_FTSR_TR_26                 (0x01U << EXTI_FTSR_TR_26_Pos)          /*!< Falling trigger event configuration bit of line 26 */
#define EXTI_FTSR_TR_27_Pos             (27)
#define EXTI_FTSR_TR_27                 (0x01U << EXTI_FTSR_TR_27_Pos)          /*!< Falling trigger event configuration bit of line 27 */
#define EXTI_FTSR_TR_28_Pos             (28)
#define EXTI_FTSR_TR_28                 (0x01U << EXTI_FTSR_TR_28_Pos)          /*!< Falling trigger event configuration bit of line 28 */
#define EXTI_FTSR_TR_29_Pos             (29)
#define EXTI_FTSR_TR_29                 (0x01U << EXTI_FTSR_TR_29_Pos)          /*!< Falling trigger event configuration bit of line 29 */
#define EXTI_FTSR_TR_30_Pos             (30)
#define EXTI_FTSR_TR_30                 (0x01U << EXTI_FTSR_TR_30_Pos)          /*!< Falling trigger event configuration bit of line 30 */
#define EXTI_FTSR_TR_31_Pos             (31)
#define EXTI_FTSR_TR_31                 (0x01U << EXTI_FTSR_TR_31_Pos)          /*!< Falling trigger event configuration bit of line 31 */

/**
  * @brief EXTI_SWIER Register Bit Definition
  */
#define EXTI_SWIER_Pos                  (0)
#define EXTI_SWIER                      (0x01U << EXTI_SWIER_Pos)               /*!< Software Interrupt */

