wub163/XW_0011_F_0162_V1.0.0/MM32F0160_Device/MM32F0160/Include/reg_exti.h
#define EXTI_SWIER_0_Pos                (0)
#define EXTI_SWIER_0                    (0x01U << EXTI_SWIER_0_Pos)             /*!< Software Interrupt on line  0 */
#define EXTI_SWIER_1_Pos                (1)
#define EXTI_SWIER_1                    (0x01U << EXTI_SWIER_1_Pos)             /*!< Software Interrupt on line  1 */
#define EXTI_SWIER_2_Pos                (2)
#define EXTI_SWIER_2                    (0x01U << EXTI_SWIER_2_Pos)             /*!< Software Interrupt on line  2 */
#define EXTI_SWIER_3_Pos                (3)
#define EXTI_SWIER_3                    (0x01U << EXTI_SWIER_3_Pos)             /*!< Software Interrupt on line  3 */
#define EXTI_SWIER_4_Pos                (4)
#define EXTI_SWIER_4                    (0x01U << EXTI_SWIER_4_Pos)             /*!< Software Interrupt on line  4 */
#define EXTI_SWIER_5_Pos                (5)
#define EXTI_SWIER_5                    (0x01U << EXTI_SWIER_5_Pos)             /*!< Software Interrupt on line  5 */
#define EXTI_SWIER_6_Pos                (6)
#define EXTI_SWIER_6                    (0x01U << EXTI_SWIER_6_Pos)             /*!< Software Interrupt on line  6 */
#define EXTI_SWIER_7_Pos                (7)
#define EXTI_SWIER_7                    (0x01U << EXTI_SWIER_7_Pos)             /*!< Software Interrupt on line  7 */
#define EXTI_SWIER_8_Pos                (8)
#define EXTI_SWIER_8                    (0x01U << EXTI_SWIER_8_Pos)             /*!< Software Interrupt on line  8 */
#define EXTI_SWIER_9_Pos                (9)
#define EXTI_SWIER_9                    (0x01U << EXTI_SWIER_9_Pos)             /*!< Software Interrupt on line  9 */
#define EXTI_SWIER_10_Pos               (10)
#define EXTI_SWIER_10                   (0x01U << EXTI_SWIER_10_Pos)            /*!< Software Interrupt on line  10 */
#define EXTI_SWIER_11_Pos               (11)
#define EXTI_SWIER_11                   (0x01U << EXTI_SWIER_11_Pos)            /*!< Software Interrupt on line  11 */
#define EXTI_SWIER_12_Pos               (12)
#define EXTI_SWIER_12                   (0x01U << EXTI_SWIER_12_Pos)            /*!< Software Interrupt on line  12 */
#define EXTI_SWIER_13_Pos               (13)
#define EXTI_SWIER_13                   (0x01U << EXTI_SWIER_13_Pos)            /*!< Software Interrupt on line  13 */
#define EXTI_SWIER_14_Pos               (14)
#define EXTI_SWIER_14                   (0x01U << EXTI_SWIER_14_Pos)            /*!< Software Interrupt on line  14 */
#define EXTI_SWIER_15_Pos               (15)
#define EXTI_SWIER_15                   (0x01U << EXTI_SWIER_15_Pos)            /*!< Software Interrupt on line  15 */
#define EXTI_SWIER_16_Pos               (16)
#define EXTI_SWIER_16                   (0x01U << EXTI_SWIER_16_Pos)            /*!< Software Interrupt on line  16 */
#define EXTI_SWIER_17_Pos               (17)
#define EXTI_SWIER_17                   (0x01U << EXTI_SWIER_17_Pos)            /*!< Software Interrupt on line  17 */
#define EXTI_SWIER_18_Pos               (18)
#define EXTI_SWIER_18                   (0x01U << EXTI_SWIER_18_Pos)            /*!< Software Interrupt on line  18 */
#define EXTI_SWIER_19_Pos               (19)
#define EXTI_SWIER_19                   (0x01U << EXTI_SWIER_19_Pos)            /*!< Software Interrupt on line  19 */
#define EXTI_SWIER_20_Pos               (20)
#define EXTI_SWIER_20                   (0x01U << EXTI_SWIER_20_Pos)            /*!< Software Interrupt on line  20 */
#define EXTI_SWIER_21_Pos               (21)
#define EXTI_SWIER_21                   (0x01U << EXTI_SWIER_21_Pos)            /*!< Software Interrupt on line  21 */
#define EXTI_SWIER_22_Pos               (22)
#define EXTI_SWIER_22                   (0x01U << EXTI_SWIER_22_Pos)            /*!< Software Interrupt on line  22 */
#define EXTI_SWIER_23_Pos               (23)
#define EXTI_SWIER_23                   (0x01U << EXTI_SWIER_23_Pos)            /*!< Software Interrupt on line  23 */
#define EXTI_SWIER_24_Pos               (24)
#define EXTI_SWIER_24                   (0x01U << EXTI_SWIER_24_Pos)            /*!< Software Interrupt on line  24 */
#define EXTI_SWIER_25_Pos               (25)
#define EXTI_SWIER_25                   (0x01U << EXTI_SWIER_25_Pos)            /*!< Software Interrupt on line  25 */
#define EXTI_SWIER_26_Pos               (26)
#define EXTI_SWIER_26                   (0x01U << EXTI_SWIER_26_Pos)            /*!< Software Interrupt on line  26 */
#define EXTI_SWIER_27_Pos               (27)
#define EXTI_SWIER_27                   (0x01U << EXTI_SWIER_27_Pos)            /*!< Software Interrupt on line  27 */
#define EXTI_SWIER_28_Pos               (28)
#define EXTI_SWIER_28                   (0x01U << EXTI_SWIER_28_Pos)            /*!< Software Interrupt on line  28 */
#define EXTI_SWIER_29_Pos               (29)
#define EXTI_SWIER_29                   (0x01U << EXTI_SWIER_29_Pos)            /*!< Software Interrupt on line  29 */
#define EXTI_SWIER_30_Pos               (30)
#define EXTI_SWIER_30                   (0x01U << EXTI_SWIER_30_Pos)            /*!< Software Interrupt on line  30 */
#define EXTI_SWIER_31_Pos               (31)
#define EXTI_SWIER_31                   (0x01U << EXTI_SWIER_31_Pos)            /*!< Software Interrupt on line  31 */

/**
  * @brief EXTI_PR Register Bit Definition
  */
#define EXTI_PR_Pos                     (0)
#define EXTI_PR                         (0x01U << EXTI_PR_Pos)                  /*!< Pending bit */

#define EXTI_PR_0_Pos                   (0)
#define EXTI_PR_0                       (0x01U << EXTI_PR_0_Pos)                /*!< Pending bit 0 */
#define EXTI_PR_1_Pos                   (1)
#define EXTI_PR_1                       (0x01U << EXTI_PR_1_Pos)                /*!< Pending bit 1 */
#define EXTI_PR_2_Pos                   (2)
#define EXTI_PR_2                       (0x01U << EXTI_PR_2_Pos)                /*!< Pending bit 2 */
#define EXTI_PR_3_Pos                   (3)
#define EXTI_PR_3                       (0x01U << EXTI_PR_3_Pos)                /*!< Pending bit 3 */
#define EXTI_PR_4_Pos                   (4)
#define EXTI_PR_4                       (0x01U << EXTI_PR_4_Pos)                /*!< Pending bit 4 */
#define EXTI_PR_5_Pos                   (5)
#define EXTI_PR_5                       (0x01U << EXTI_PR_5_Pos)                /*!< Pending bit 5 */
#define EXTI_PR_6_Pos                   (6)
#define EXTI_PR_6                       (0x01U << EXTI_PR_6_Pos)                /*!< Pending bit 6 */
#define EXTI_PR_7_Pos                   (7)
#define EXTI_PR_7                       (0x01U << EXTI_PR_7_Pos)                /*!< Pending bit 7 */
#define EXTI_PR_8_Pos                   (8)
#define EXTI_PR_8                       (0x01U << EXTI_PR_8_Pos)                /*!< Pending bit 8 */
#define EXTI_PR_9_Pos                   (9)
#define EXTI_PR_9                       (0x01U << EXTI_PR_9_Pos)                /*!< Pending bit 9 */
#define EXTI_PR_10_Pos                  (10)
#define EXTI_PR_10                      (0x01U << EXTI_PR_10_Pos)               /*!< Pending bit 10 */
#define EXTI_PR_11_Pos                  (11)
#define EXTI_PR_11                      (0x01U << EXTI_PR_11_Pos)               /*!< Pending bit 11 */
#define EXTI_PR_12_Pos                  (12)
#define EXTI_PR_12                      (0x01U << EXTI_PR_12_Pos)               /*!< Pending bit 12 */
#define EXTI_PR_13_Pos                  (13)
#define EXTI_PR_13                      (0x01U << EXTI_PR_13_Pos)               /*!< Pending bit 13 */
#define EXTI_PR_14_Pos                  (14)
#define EXTI_PR_14                      (0x01U << EXTI_PR_14_Pos)               /*!< Pending bit 14 */
#define EXTI_PR_15_Pos                  (15)
#define EXTI_PR_15                      (0x01U << EXTI_PR_15_Pos)               /*!< Pending bit 15 */
#define EXTI_PR_16_Pos                  (16)
#define EXTI_PR_16                      (0x01U << EXTI_PR_16_Pos)               /*!< Pending bit 16 */
#define EXTI_PR_17_Pos                  (17)
#define EXTI_PR_17                      (0x01U << EXTI_PR_17_Pos)               /*!< Pending bit 17 */
#define EXTI_PR_18_Pos                  (18)
#define EXTI_PR_18                      (0x01U << EXTI_PR_18_Pos)               /*!< Pending bit 18 */
#define EXTI_PR_19_Pos                  (19)
#define EXTI_PR_19                      (0x01U << EXTI_PR_19_Pos)               /*!< Pending bit 19 */
#define EXTI_PR_20_Pos                  (20)
#define EXTI_PR_20                      (0x01U << EXTI_PR_20_Pos)               /*!< Pending bit 20 */
#define EXTI_PR_21_Pos                  (21)
#define EXTI_PR_21                      (0x01U << EXTI_PR_21_Pos)               /*!< Pending bit 21 */
#define EXTI_PR_22_Pos                  (22)
#define EXTI_PR_22                      (0x01U << EXTI_PR_22_Pos)               /*!< Pending bit 22 */
#define EXTI_PR_23_Pos                  (23)
#define EXTI_PR_23                      (0x01U << EXTI_PR_23_Pos)               /*!< Pending bit 23 */
#define EXTI_PR_24_Pos                  (24)
#define EXTI_PR_24                      (0x01U << EXTI_PR_24_Pos)               /*!< Pending bit 24 */
#define EXTI_PR_25_Pos                  (25)
#define EXTI_PR_25                      (0x01U << EXTI_PR_25_Pos)               /*!< Pending bit 25 */
#define EXTI_PR_26_Pos                  (26)
#define EXTI_PR_26                      (0x01U << EXTI_PR_26_Pos)               /*!< Pending bit 26 */
#define EXTI_PR_27_Pos                  (27)
#define EXTI_PR_27                      (0x01U << EXTI_PR_27_Pos)               /*!< Pending bit 27 */
#define EXTI_PR_28_Pos                  (28)
#define EXTI_PR_28                      (0x01U << EXTI_PR_28_Pos)               /*!< Pending bit 28 */
#define EXTI_PR_29_Pos                  (29)
#define EXTI_PR_29                      (0x01U << EXTI_PR_29_Pos)               /*!< Pending bit 29 */
#define EXTI_PR_30_Pos                  (30)
#define EXTI_PR_30                      (0x01U << EXTI_PR_30_Pos)               /*!< Pending bit 30 */
#define EXTI_PR_31_Pos                  (31)
#define EXTI_PR_31                      (0x01U << EXTI_PR_31_Pos)               /*!< Pending bit 31 */

/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */

#ifdef __cplusplus
}
#endif

/*----------------------------------------------------------------------------*/
#endif
/*----------------------------------------------------------------------------*/
